# 算数运算符
# + - * /
# // 整除
# % 除余
# ** 指数
# （） 小括号
# （）优先于**优先于// % * /优先于+-

a = (3+4)**2
print(a)

# 赋值运算符“=”
num1,num2,str1 = 1,1.3,'小猫'
b = c = 8
print(str1)
print(b)

# 复合赋值运算符  += -= *=   等等---
# a += 1 相当于a = a + 1
d = 4
d -= 3
print(d)

# 注意：先算等号右边的
e = 10
e *= 1 + 2
print(e)

# 比较运算符 
# == 等于
# >= 大于等于
# <= 小于等于
# != 不等于


# 逻辑运算符 and or not
# and 都真才真
# or 一真则真，都假才假
# not 取反

# 扩展：数字间的逻辑运算
f = 0
g = 1
h = 2

# and 只要一个值为0，则结果为0.否则结果为最后一个非0数字
print(f and g)
print(g and h)

# or 只有所有值为0，结果才为0。否则结果为第一个非0数字
print(f or g)
print(g or h)